Switch>
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#interface vlan1
Switch(config-if)#ip add 10.0.0.3 255.0.0.0
Switch(config-if)#no shut

Switch(config-if)#
%LINK-3-UPDOWN: Interface Vlan1, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up
end
Switch#
%SYS-5-CONFIG_I: Configured from console by console
sh run


test - telnet 10.0.0.3 (Before)

Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#username sh password 123
Switch(config)#line vty 0 15
Switch(config-line)#login local
Switch(config-line)#transport input telnet
Switch(config-line)#end
Switch#
%SYS-5-CONFIG_I: Configured from console by console
sh run

after test - telnet 10.0.0.3

For SSH --------

Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname sh
sh(config)#ip domain-name shash
sh(config)#username user password 12345
sh(config)#line vty 0 15
sh(config-line)#login local
sh(config-line)#transport input ssh
sh(config-line)#exit
sh(config)#crypto key generate rsa
The name for the keys will be: sh.shash
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 
% Generating 512 bit RSA keys, keys will be non-exportable...[OK]

sh(config)#exit
*Mar 1 0:8:4.293: RSA key size needs to be at least 768 bits for ssh version 2
*Mar 1 0:8:4.293: %SSH-5-ENABLED: SSH 1.5 has been enabled
sh#
%SYS-5-CONFIG_I: Configured from console by console

sh#
