Task 7b(dynamic nat)

Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int fa0/0
Router(config-if)#ip add 10.0.0.1 255.0.0.0
Router(config-if)#no shut

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#ip nat inside
Router(config-if)#ex
Router(config)#int fa1/0
Router(config-if)#ip add 155.4.12.1 255.255.0.0
Router(config-if)#no shut

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet1/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/0, changed state to up

Router(config-if)#ip nat inside
Router(config-if)#ip nat outside
Router(config-if)#ex
Router(config)#access-list 1 permit 10.0.0.0 0.0.0.255
Router(config)#ip nat pool newpool 155.4.12.1 155.4.12.3 netmask 255.255.255.0
Router(config)#ip nat inside source list 1 pool newpool
Router(config)#ip route 0.0.0.0 0.0.0.0 155.4.12.5
Router(config)#ex
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#sh ip nat translations
Router#sh ip nat translations
Router#sh ip nat translations
Router#sh ip nat translations
Pro  Inside global     Inside local       Outside local      Outside global
icmp 155.4.12.1:1      10.0.0.3:1         155.4.12.5:1       155.4.12.5:1
icmp 155.4.12.1:2      10.0.0.3:2         155.4.12.5:2       155.4.12.5:2
icmp 155.4.12.1:3      10.0.0.3:3         155.4.12.5:3       155.4.12.5:3
icmp 155.4.12.1:4      10.0.0.3:4         155.4.12.5:4       155.4.12.5:4
icmp 155.4.12.1:5      10.0.0.3:5         155.4.12.5:5       155.4.12.5:5
icmp 155.4.12.1:6      10.0.0.3:6         155.4.12.5:6       155.4.12.5:6
icmp 155.4.12.1:7      10.0.0.3:7         155.4.12.5:7       155.4.12.5:7
icmp 155.4.12.1:8      10.0.0.3:8         155.4.12.5:8       155.4.12.5:8

Router#
Router#






















Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int fa0/0
Router(config-if)#ip add 10.0.0.1 255.0.0.0
Router(config-if)#no shut

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#ip nat inside
Router(config-if)#ex
Router(config)#int fa1/0
Router(config-if)#ip add 20.0.0.1 255.0.0.0
Router(config-if)#no shut

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet1/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/0, changed state to up

Router(config-if)#ip nat inside
Router(config-if)#ip nat outside
Router(config-if)#ex
Router(config)#access-list 1 permit 10.0.0.0 0.0.0.255
Router(config)#ip nat pool newpool 20.0.0.1 20.0.0.3 netmask 255.0.0.0
Router(config)#ip nat inside source list 1 pool newpool
Router(config)#ip route 0.0.0.0 0.0.0.0 20.0.0.5
Router(config)#ex
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#sh ip nat translations
Router#sh ip nat translations

#DO THIS COMMAND AFTER PINGING SERVER FROM PC

Router#sh ip nat translations
Pro  Inside global     Inside local       Outside local      Outside global
icmp 20.0.0.1:1        10.0.0.2:1         20.0.0.5:1         20.0.0.5:1
icmp 20.0.0.1:2        10.0.0.2:2         20.0.0.5:2         20.0.0.5:2
icmp 20.0.0.1:3        10.0.0.2:3         20.0.0.5:3         20.0.0.5:3
icmp 20.0.0.1:4        10.0.0.2:4         20.0.0.5:4         20.0.0.5:4
icmp 20.0.0.1:5        10.0.0.2:5         20.0.0.5:5         20.0.0.5:5
icmp 20.0.0.1:6        10.0.0.2:6         20.0.0.5:6         20.0.0.5:6
icmp 20.0.0.1:7        10.0.0.2:7         20.0.0.5:7         20.0.0.5:7
icmp 20.0.0.1:8        10.0.0.2:8         20.0.0.5:8         20.0.0.5:8

Router#
